# one dimenstion array:-

In [4]:
import numpy as np

In [6]:
a=list(range(1,10))
b=list(range(11,20))
c=list(range(21,30))
d=list(range(31,40))
mylist=[a,[b,[c,[d]]]]
mylist

[[1, 2, 3, 4, 5, 6, 7, 8, 9],
 [[11, 12, 13, 14, 15, 16, 17, 18, 19],
  [[21, 22, 23, 24, 25, 26, 27, 28, 29],
   [[31, 32, 33, 34, 35, 36, 37, 38, 39]]]]]

In [16]:
mylist[1][1][1][0][::-1]

[39, 38, 37, 36, 35, 34, 33, 32, 31]

In [18]:
import numpy as np
import pandas as pd

# How to extract csv file and download and read and copy the path?

In [38]:
df = pd.read_csv(r"C:\Users\Lenovo\Downloads\archive\auction.csv")
df

,PLAYER,NATIONALITY,TYPE,TEAM,PRICE PAID
0,Daryl Mitchell,Overseas,All-Rounder,Chennai Super Kings,140000000
1,Sameer Rizvi,Indian,Batter,Chennai Super Kings,84000000
2,Shardul Thakur,Indian,All-Rounder,Chennai Super Kings,40000000
3,Mustafizur Rahman,Overseas,Bowler,Chennai Super Kings,20000000
4,Rachin Ravindra,Overseas,All-Rounder,Chennai Super Kings,18000000
...,...,...,...,...,...
67,Travis Head,Overseas,Batter,Sunrisers Hyderabad,68000000
68,Jaydev Unadkat,Indian,Bowler,Sunrisers Hyderabad,16000000
69,Wanindu Hasaranga,Overseas,All-Rounder,Sunrisers Hyderabad,15000000
70,Jhathavedh Subramanyan,Indian,Bowler,Sunrisers Hyderabad,2000000
71,Akash Singh,Indian,Bowler,Sunrisers Hyderabad,2000000

In [40]:
df = pd.read_csv(r"C:\Users\Lenovo\OneDrive\Documents\Choc Dataset\Chocolate Sales.csv")
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [58]:
import pandas as pd
df = pd.read_csv(r"C:\Users\Lenovo\OneDrive\Documents\Choc Dataset\Chocolate Sales.csv")
print(df.head())

     Sales Person    Country              Product       Date    Amount  \
0  Jehu Rudeforth         UK      Mint Chip Choco  04-Jan-22   $5,320
1     Van Tuxwell      India        85% Dark Bars  01-Aug-22   $7,896
2    Gigi Bohling      India  Peanut Butter Cubes  07-Jul-22   $4,501
3    Jan Morforth  Australia  Peanut Butter Cubes  27-Apr-22  $12,726
4  Jehu Rudeforth         UK  Peanut Butter Cubes  24-Feb-22  $13,685

   Boxes Shipped
0            180
1             94
2             91
3            342
4            184

In [62]:
df['Amount'] = df['Amount'].replace({r'\$': '', r',': ''}, regex=True).astype(float)
print(df['Amount'].head())

0     5320.0
1     7896.0
2     4501.0
3    12726.0
4    13685.0
Name: Amount, dtype: float64

In [64]:
df['Date'] = pd.to_datetime(df['Date'], format='%d-%b-%y')
print(df['Date'].head())

0   2022-01-04
1   2022-08-01
2   2022-07-07
3   2022-04-27
4   2022-02-24
Name: Date, dtype: datetime64[ns]

In [66]:
total_by_country = df.groupby('Country')['Amount'].sum().reset_index()
print(total_by_country)

       Country     Amount
0    Australia  1137367.0
1       Canada   962899.0
2        India  1045800.0
3  New Zealand   950418.0
4           UK  1051792.0
5          USA  1035349.0

In [68]:
top_salespersons = df.groupby('Sales Person')['Amount'].sum().sort_values(ascending=False).head(3)
print(top_salespersons)

Sales Person
Ches Bonnell       320901.0
Oby Sorrel         316645.0
Madelene Upcott    316099.0
Name: Amount, dtype: float64

In [70]:
avg_boxes_country = df.groupby('Country')['Boxes Shipped'].mean().reset_index()
print(avg_boxes_country)

       Country  Boxes Shipped
0    Australia     159.253659
1       Canada     178.405714
2        India     160.163043
3  New Zealand     153.641618
4           UK     170.028090
5          USA     149.854749

In [72]:
df['Month'] = df['Date'].dt.to_period('M')
monthly_sales = df.groupby('Month')['Amount'].sum().sort_values(ascending=False)
print(monthly_sales.head(1))

Month
2022-01    896105.0
Freq: M, Name: Amount, dtype: float64

In [74]:
unique_products = df['Product'].nunique()
print(f"Total unique products: {unique_products}")

Total unique products: 22

In [76]:
high_sales = df[df['Amount'] > 10000]
print(high_sales)

             Sales Person      Country              Product       Date  \
3            Jan Morforth    Australia  Peanut Butter Cubes 2022-04-27
4          Jehu Rudeforth           UK  Peanut Butter Cubes 2022-02-24
6              Oby Sorrel           UK      99% Dark & Pure 2022-01-25
31    Rafaelita Blaksland           UK      99% Dark & Pure 2022-06-29
41       Karlen McCaffrey          USA      Raspberry Choco 2022-04-15
...                   ...          ...                  ...        ...
1051          Van Tuxwell        India              Eclairs 2022-07-21
1067       Camilla Castle  New Zealand        85% Dark Bars 2022-08-08
1075      Roddy Speechley        India  Spicy Special Slims 2022-03-22
1081  Dennison Crosswaite          USA   Smooth Sliky Salty 2022-05-12
1083      Madelene Upcott  New Zealand            Milk Bars 2022-03-29

       Amount  Boxes Shipped    Month
3     12726.0            342  2022-04
4     13685.0            184  2022-02
6     13685.0            176  2022-01
31    12446.0            150  2022-06
41    14749.0            354  2022-04
...       ...            ...      ...
1051  10500.0            106  2022-07
1067  15099.0             55  2022-08
1075  10647.0            173  2022-03
1081  11781.0             91  2022-05
1083  12558.0            403  2022-03

[165 rows x 7 columns]

In [78]:
product_summary = df.groupby('Product').agg({'Amount': 'sum', 'Boxes Shipped': 'sum'}).reset_index()
print(product_summary)

                 Product    Amount  Boxes Shipped
0         50% Dark Bites  341712.0           9792
1         70% Dark Bites  211610.0           8015
2          85% Dark Bars  299229.0           7793
3        99% Dark & Pure  299796.0           8127
4            After Nines  261331.0           8257
5           Almond Choco  277536.0           6736
6    Baker's Choco Chips  249613.0           6998
7   Caramel Stuffed Bars  231588.0           8717
8   Choco Coated Almonds  241486.0           6464
9          Drinking Coco  256655.0           8660
10               Eclairs  312445.0           8757
11      Fruit & Nut Bars  259147.0           7738
12    Manuka Honey Choco  275541.0           7781
13             Milk Bars  269248.0           8330
14       Mint Chip Choco  283969.0           8207
15          Orange Choco  256144.0           7732
16   Organic Choco Syrup  294700.0           7749
17   Peanut Butter Cubes  324842.0           8304
18       Raspberry Choco  264740.0           7115
19    Smooth Sliky Salty  349692.0           8810
20   Spicy Special Slims  293454.0           8685
21            White Choc  329147.0           8240

In [80]:
import pandas as pd

df = pd.read_csv(r"C:\Users\Lenovo\Downloads\archive\auction.csv")
print(df.head())

              PLAYER NATIONALITY         TYPE                 TEAM  PRICE PAID
0     Daryl Mitchell    Overseas  All-Rounder  Chennai Super Kings   140000000
1       Sameer Rizvi      Indian       Batter  Chennai Super Kings    84000000
2     Shardul Thakur      Indian  All-Rounder  Chennai Super Kings    40000000
3  Mustafizur Rahman    Overseas       Bowler  Chennai Super Kings    20000000
4    Rachin Ravindra    Overseas  All-Rounder  Chennai Super Kings    18000000

In [82]:
players_per_team = df['TEAM'].value_counts()
print(players_per_team)

TEAM
Kolkata Knight Riders          10
Delhi Capitals                  9
Gujarat Titans                  8
Mumbai Indians                  8
Punjab Kings                    8
Chennai Super Kings             6
Lucknow Super Giants            6
Royal Challengers Bengaluru     6
Sunrisers Hyderabad             6
Rajasthan Royals                5
Name: count, dtype: int64